app/views/spots/show.html.erb

  <% if !@spot.availability? %>
    <%= link_to @spot.parkings.last.vehicle.name, vehicle_path(@spot.parkings.last.vehicle) %> Parked Here
  <% end %>
  <% @spot.parkings.where(occupied: false).each do |parking| %>
---
SELECT  "vehicles".* FROM "vehicles" WHERE "vehicles"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "parkings".* FROM "parkings" WHERE "parkings"."spot_id" = $1 AND "parkings"."occupied" = $2  [["spot_id", 1], ["occupied", "f"]]