app/controllers/parkings_controller.rb

SELECT "parkings".* FROM "parkings"
---
  def index
    @parkings = Parking.all

INSERT INTO "parkings" ("spot_id", "vehicle_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["spot_id", 1], ["vehicle_id", 1], ["created_at", "2018-06-24 03:48:25.391942"], ["updated_at", "2018-06-24 03:48:25.391942"]]
---
  def create
    @parking = Parking.new(parking_params)
    respond_to do |format|
      if @parking.save

UPDATE "parkings" SET "occupied" = $1, "updated_at" = $2 WHERE "parkings"."id" = $3  [["occupied", "f"], ["updated_at", "2018-06-24 03:53:30.778314"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @parking.update(parking_params)

SELECT  "parkings".* FROM "parkings" WHERE "parkings"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_parking
      @parking = Parking.find(params[:id])