app/controllers/spots_controller.rb

  def index
    @spots = Spot.all
---
SELECT "spots".* FROM "spots"

  def create
    @spot = Spot.new(spot_params)
    @spot.availability=true
    respond_to do |format|
      if @spot.save
---
INSERT INTO "spots" ("name", "type_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "A1"], ["type_id", 2], ["created_at", "2018-06-14 06:23:49.227348"], ["updated_at", "2018-06-14 06:23:49.227348"]]

  def update
    respond_to do |format|
      if @spot.update(spot_params)
---
UPDATE "spots" SET "availability" = $1, "updated_at" = $2 WHERE "spots"."id" = $3  [["availability", "f"], ["updated_at", "2018-06-24 02:43:56.624627"], ["id", 1]]

    def set_spot
      @spot = Spot.find(params[:id])
---
SELECT  "spots".* FROM "spots" WHERE "spots"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]