app/controllers/vehicles_controller.rb

  def index
    @q = Vehicle.ransack(params[:q])
    @vehicles = @q.result(distinct: true)
    @vehicles = Vehicle.all
---
SELECT DISTINCT "vehicles".* FROM "vehicles"

  def create
    @vehicle = Vehicle.new(vehicle_params)

    respond_to do |format|
      if @vehicle.save
---
INSERT INTO "vehicles" ("file_name", "name", "model", "vnumber", "insurance_expiry_date", "pollution_expiry_date", "created_at", "updated_at", "type_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"

  def update
    respond_to do |format|
      if @vehicle.update(vehicle_params)
---
UPDATE "vehicles" SET "insurance_expiry_date" = $1, "pollution_expiry_date" = $2, "updated_at" = $3 WHERE "vehicles"."id" = $4  [["insurance_expiry_date", "2018-06-24 03:17:00"], ["pollution_expiry_date", "2018-06-24 03:17:00"], ["updated_at", "2018-06-24 03:17:10.929157"], ["id", 1]]