app/views/vehicles/show.html.erb

      <tbody>
        <% if @vehicle.vehicle_fines.count > 0 %>
---
SELECT "vehicle_fines".* FROM "vehicle_fines" WHERE "vehicle_fines"."vehicle_id" = $1  [["vehicle_id", 1]]

    <% if @vehicle.parked? %>
      <% parking = @vehicle.parkings.find_by(occupied: true) %>
---
SELECT  "parkings".* FROM "parkings" WHERE "parkings"."vehicle_id" = $1 AND "parkings"."occupied" = $2 LIMIT $3  [["vehicle_id", 1], ["occupied", "t"], ["LIMIT", 1]]

        <tbody>
        <% Spot.where(type: @vehicle.type, availability: true).each do |spot| %>
---
SELECT  "spots".* FROM "spots" WHERE "spots"."type_id" = 2 LIMIT $1  [["LIMIT", 1]]
SELECT  "types".* FROM "types" WHERE "types"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]